export const VALIDATIONS = Object.freeze({
  firstName: {
    regex: /^[\u05D0-\u05EAa-zA-Z\s]*$/,
    error:
      "* שם פרטי לא חוקי. חייב להכיל רק טקסט - ללא מספרים או תווים מיוחדים",
  },
  lastName: {
    regex: /^[\u05D0-\u05EAa-zA-Z\s]*$/,
    error:
      "* שם פרטי לא חוקי. חייב להכיל רק טקסט - ללא מספרים או תווים מיוחדים",
  },
  bDay: {
    error:
      "תאריך לידה לא חוקי. רק משתמשים בגילאי 18 עד 120 רשאים להירשם למערכת ",
  },
  street: {
    regex: /^$|^[א-ת]+$/,
    error: "שם הרחוב לא חוקי. שם הרחוב חייב להיות בעברית בלבד.",
  },
  flatNumber: {
    regex: /^$|^[1-9]\d*$/,
    error: "מספר דירה לא חוקי. יש להכניס רק מספרים חיוביים שלמים.",
  },
  username: {
    regex: /^[a-zA-Z0-9 !"#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~]*$/,
    error:
      "שם משתמש לא חוקי. יכול להכיל רק אותיות לועזיות, מספרים ותווים מיוחדים.",
  },
  email: {
    regex:
      /^$|^[a-zA-Z!#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~]+@[a-zA-Z!#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~]+\.(com)$/,
    error:
      " כתובת מייל לא חוקית. ניתן להזין אותיות לועזיות בלבד ותווים מיוחדים, התו @ מופיע פעם אחת בלבד, בסוף הטקסט יש com. בלבד.  ",
  },
  password_1: {
    regex:
      /^$|^(?=.*[A-Z])(?=.*\d)(?=.*[ !"#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~])[\u05D0-\u05EAA-Za-z\d !"#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~]*$/,
    error:
      "סיסמא לא חוקית. חייבת להכיל בין 7 ל- 12 תווים. יש לוודא שיש לפחות תו אחד מיוחד, אות גדולה ומספר.",
  },
  password_2: {
    regex:
      /^$|^(?=.*[A-Z])(?=.*\d)(?=.*[ !"#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~])[\u05D0-\u05EAA-Za-z\d !"#$%&'()*+,-./:;<=>?@[\\\]^_`{|}~]*$/,
    error:
      "סיסמא לא חוקית. חייבת להכיל בין 7 ל- 12 תווים. יש לוודא שיש לפחות תו אחד מיוחד, אות גדולה ומספר.",
  },
});

export const citiesList = [
  "תל אביב",
  "ירושלים",
  "חיפה",
  "ראשון לציון",
  "פתח תקווה",
  "אשדוד",
  "נתניה",
  "באר שבע",
  "חולון",
  "בת ים",
  "רמת גן",
  "אשקלון",
  "בני ברק",
  "חריש",
  "מודיעין",
  "רמלה",
  "קריית גת",
  "רעננה",
  "כפר סבא",
  "לוד",
  "קריית אתא",
  "קריית אונו",
  "ראש העין",
  "נצרת",
  "הרצליה",
  "לקיה",
  "רהט",
  "קריית ים",
  "נהריה",
  "קריית מלאכי",
  "אור יהודה",
  "קריית ביאליק",
  "קריית שמונה",
  "קריית טבעון",
  "עכו",
  "טבריה",
  "באקה אל-גרביה",
  "אום אל-פחם",
  "סח'נין",
  "טירה",
  "קריית עקרון",
  "גבעתיים",
  "ביתר עילית",
  "טירת הכרמל",
  "נס ציונה",
  "יבנה",
  "אופקים",
  "עפולה",
  "בית שאן",
  "גבעת שמואל",
  "קריית שלמה",
  "באר יעקב",
  "יהוד-מונוסון",
  "טייבה",
  "כפר קאסם",
  "ערד",
  "שדרות",
  "ג'לג'וליה",
  "ג'ש (גוש חלב)",
  "עתלית",
  "דימונה",
  "נשר",
  "יקנעם עילית",
  "גן יבנה",
  "רמת השרון",
  "מעלה אדומים",
  "אריאל",
  "בית שמש",
  "נצרת עילית",
];

export const months = [
  "ינואר",
  "פברואר",
  "מרץ",
  "אפריל",
  "מאי",
  "יוני",
  "יולי",
  "אוגוסט",
  "ספטמבר",
  "אוקטובר",
  "נובמבר",
  "דצמבר",
];
